In [2]:
import numpy as np
import pandas as pd

float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data = pd.Series(['aardvark', None, np.nan, 'avocado'])
string_data

0    aardvark
1        None
2         NaN
3     avocado
dtype: object

In [8]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [9]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[~data.isna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.211145       NaN       NaN
1 -0.323947       NaN       NaN
2 -2.486665       NaN -0.984665
3  0.639233       NaN -0.628099
4 -2.624764 -0.092919 -0.518360
5 -0.398499 -0.751268 -0.113937
6 -3.080345  0.612733 -1.649895

In [21]:
df.dropna()

          0         1         2
4 -2.624764 -0.092919 -0.518360
5 -0.398499 -0.751268 -0.113937
6 -3.080345  0.612733 -1.649895

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -2.486665       NaN -0.984665
3  0.639233       NaN -0.628099
4 -2.624764 -0.092919 -0.518360
5 -0.398499 -0.751268 -0.113937
6 -3.080345  0.612733 -1.649895

In [26]:
df.dropna(axis=1, thresh=2)

          0         1         2
0  1.211145       NaN       NaN
1 -0.323947       NaN       NaN
2 -2.486665       NaN -0.984665
3  0.639233       NaN -0.628099
4 -2.624764 -0.092919 -0.518360
5 -0.398499 -0.751268 -0.113937
6 -3.080345  0.612733 -1.649895

In [27]:
df.fillna(0)

          0         1         2
0  1.211145  0.000000  0.000000
1 -0.323947  0.000000  0.000000
2 -2.486665  0.000000 -0.984665
3  0.639233  0.000000 -0.628099
4 -2.624764 -0.092919 -0.518360
5 -0.398499 -0.751268 -0.113937
6 -3.080345  0.612733 -1.649895

In [28]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.211145  0.500000  0.000000
1 -0.323947  0.500000  0.000000
2 -2.486665  0.500000 -0.984665
3  0.639233  0.500000 -0.628099
4 -2.624764 -0.092919 -0.518360
5 -0.398499 -0.751268 -0.113937
6 -3.080345  0.612733 -1.649895

In [30]:
df.T.fillna({1: 0.5, 2: -1}).T

          0         1         2
0  1.211145       NaN       NaN
1 -0.323947  0.500000  0.500000
2 -2.486665 -1.000000 -0.984665
3  0.639233       NaN -0.628099
4 -2.624764 -0.092919 -0.518360
5 -0.398499 -0.751268 -0.113937
6 -3.080345  0.612733 -1.649895

In [31]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.377233 -0.830934 -0.632976
1 -0.271069  0.089964  0.499544
2  0.448395       NaN -0.028533
3  0.610170       NaN  0.738416
4 -0.620739       NaN       NaN
5 -1.095035       NaN       NaN

In [34]:
df.ffill()

          0         1         2
0  0.377233 -0.830934 -0.632976
1 -0.271069  0.089964  0.499544
2  0.448395  0.089964 -0.028533
3  0.610170  0.089964  0.738416
4 -0.620739  0.089964  0.738416
5 -1.095035  0.089964  0.738416

In [35]:
df.ffill(limit=2)

          0         1         2
0  0.377233 -0.830934 -0.632976
1 -0.271069  0.089964  0.499544
2  0.448395  0.089964 -0.028533
3  0.610170  0.089964  0.738416
4 -0.620739       NaN  0.738416
5 -1.095035       NaN  0.738416

In [36]:
df.fillna(0, limit=2)

          0         1         2
0  0.377233 -0.830934 -0.632976
1 -0.271069  0.089964  0.499544
2  0.448395  0.000000 -0.028533
3  0.610170  0.000000  0.738416
4 -0.620739       NaN  0.000000
5 -1.095035       NaN  0.000000

In [37]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7, np.nan, 2., np.nan])
data.fillna(data.mean())

0    1.000
1    3.375
2    3.500
3    3.375
4    7.000
5    3.375
6    2.000
7    3.375
dtype: float64

In [38]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [41]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [42]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                            'pastrami', 'honey ham', 'nova lox'],
                     'ounces':[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [47]:
def get_animal(food):
    return meat_to_animal[food.lower()]

In [48]:
data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [49]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [51]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [52]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [53]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [56]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [58]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [61]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [62]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [63]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [64]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [65]:
cats.categories[0]

Interval(18, 25, closed='right')

In [67]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [68]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
cats = pd.cut(ages, bins, labels=group_names)

In [69]:
cats

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [70]:
data = np.random.uniform(size=20)
data

array([0.05112687, 0.27923091, 0.31112998, 0.99776074, 0.89504983,
       0.05693176, 0.35215814, 0.32787691, 0.36713237, 0.92554826,
       0.74819034, 0.03278674, 0.77807391, 0.67170569, 0.04186306,
       0.80165961, 0.00921363, 0.25524623, 0.63127531, 0.02020519])

In [72]:
cats = pd.cut(data, 4, precision=2)
cats

[(0.0082, 0.26], (0.26, 0.5], (0.26, 0.5], (0.75, 1.0], (0.75, 1.0], ..., (0.75, 1.0], (0.0082, 0.26], (0.0082, 0.26], (0.5, 0.75], (0.0082, 0.26]]
Length: 20
Categories (4, interval[float64, right]): [(0.0082, 0.26] < (0.26, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [73]:
cats.value_counts()

(0.0082, 0.26]    7
(0.26, 0.5]       5
(0.5, 0.75]       3
(0.75, 1.0]       5
Name: count, dtype: int64

In [74]:
data = np.random.standard_normal(1000)
data

array([ 1.03707380e-01, -4.76834012e-01, -1.30819522e-02,  1.10333083e+00,
       -6.93178803e-01, -3.77312108e-01, -7.98051787e-01,  1.37937255e+00,
       -1.41789649e+00,  2.96680720e-01, -8.51070108e-01,  4.04732549e-01,
       -1.73484650e-01, -6.81750337e-01,  1.24845585e+00, -2.45043014e-01,
       -5.15957772e-01,  7.64150359e-01, -5.44582467e-01, -8.72519326e-01,
       -2.52249291e-01, -9.97857829e-01,  1.88904142e+00,  1.10093521e+00,
        7.54069105e-01,  1.86312254e-01, -8.02899190e-01, -1.27634772e+00,
        3.20059912e-01, -8.93898442e-01,  4.47053008e-01, -9.65652613e-02,
       -1.31136847e+00, -1.99633662e-01, -1.17001985e+00,  6.23050812e-01,
        1.34415482e+00,  9.94498236e-01, -8.99650553e-02,  3.14361287e+00,
       -1.22624511e+00,  1.84680151e+00, -1.91898100e+00, -4.40309430e-01,
       -2.34032618e-01, -1.04530142e+00,  3.85736816e-01,  1.30222943e+00,
        1.03322999e+00,  1.64516921e+00, -8.64912528e-01,  8.72922122e-01,
        2.74791639e+00, -1.57532778e-01,  1.00845499e+00,  8.09975950e-01,
       -1.53007600e+00, -9.15781308e-01, -8.47505687e-02, -4.04588191e-02,
       -9.87120133e-01, -1.51568575e-01, -1.38598067e+00, -8.52352137e-01,
        1.68050415e-01,  1.93148059e+00,  1.09271960e+00, -9.56921189e-02,
        1.11754561e+00,  1.15836175e+00,  7.82868311e-01,  1.67351327e+00,
        1.83888111e-01, -2.05167871e+00, -2.81270330e+00, -1.12098847e-01,
        2.06096751e+00,  1.68468600e+00, -2.50974760e+00, -1.39491354e+00,
       -2.33667791e+00, -4.49038213e-01,  4.63247907e-01,  3.06253402e-01,
       -1.21500853e+00,  3.99291037e-01, -1.02888721e+00,  7.13551418e-02,
       -1.18709699e+00, -1.02847581e+00,  1.96387740e-01,  1.11329518e+00,
       -2.83919413e-01, -7.39559164e-02, -1.08988283e+00,  8.69779073e-01,
       -3.11490441e-01, -9.87148103e-01,  1.67561634e+00, -2.24419789e-01,
        1.37633126e+00,  1.03079314e+00, -4.21543229e-01,  1.07968182e+00,
       -2.79474187e-01, -9.47086314e-01,  1.88962053e-01,  1.44217155e-01,
        1.47266281e+00, -8.85464240e-02, -4.02386016e-01, -1.21997162e+00,
        1.69720690e+00,  1.62200156e+00, -1.37135578e-01,  7.77620705e-01,
       -2.80544612e-01,  4.67776170e-01, -6.93101009e-01, -7.40483731e-02,
        1.12279484e+00,  3.38894911e-01, -1.73921255e+00, -1.49063187e+00,
       -7.79503731e-01,  1.80594897e+00,  2.45086813e-01, -2.50674851e-01,
        1.73366811e-01,  3.66827516e-01, -2.88090030e-01,  2.81372904e-02,
        3.62426656e-01, -2.95513651e-01,  3.20708931e-01,  1.37644717e+00,
       -4.06833842e-02,  1.00907408e+00,  1.53511127e+00, -2.29723673e-01,
       -4.14918351e-01,  1.41886856e+00,  3.58838918e-01, -4.21818584e-01,
       -8.78715350e-01,  3.79092570e-01,  1.69215988e+00,  1.82307486e+00,
        1.90364747e-01,  2.47733232e-01,  8.11876994e-01,  1.24802626e+00,
        6.96374449e-01,  1.55807818e+00, -5.22425469e-01, -5.85493234e-01,
       -1.23164085e+00, -6.22712890e-03, -6.60927837e-01, -1.47682928e+00,
        3.32268387e-01,  1.42508798e+00,  1.54448383e+00, -6.24073505e-01,
        1.29930846e+00,  1.02455454e+00, -9.97398915e-01, -3.96033002e-01,
        9.87578052e-01, -1.11582455e+00,  6.78718646e-01,  6.88871466e-01,
        9.97359970e-01,  2.71434261e-01, -1.31339804e-01,  3.31749699e-01,
       -1.99498075e-01,  1.96432002e-01,  7.57945270e-01,  7.92611871e-01,
       -9.42610904e-01, -1.29457029e-01, -1.54733104e+00, -1.81425235e+00,
        4.40953997e-01, -9.32144946e-01,  3.08541666e-01,  1.05859130e+00,
        1.14551490e+00, -5.69224660e-01,  1.17224609e+00,  1.74956215e+00,
       -1.07874051e-01,  4.98681547e-01, -8.41115084e-01,  1.48810243e+00,
        6.08059597e-01, -1.62379030e+00, -1.38739385e+00,  1.23448933e+00,
        3.99375896e-01,  4.16960253e-01, -1.24625693e+00,  5.47991345e-02,
       -1.02020182e+00,  6.10890692e-01,  2.64987626e-01,  9.27202400e-02,
        1.27771750e+00,  1.55445034e+00, -8.38042772e-01,  6.39105797e-01,
        1.16183749e-01, -6.06110072e-01, -1.15995290e+00, -3.03750437e-01,
        1.60366430e-01,  6.20673072e-01, -7.73554501e-02,  9.37036978e-01,
        1.51878830e-01,  2.96008531e-01,  5.22350446e-01, -1.27783628e-01,
       -1.00730491e+00, -9.95071543e-01,  6.48576076e-01,  1.00031305e+00,
        5.68619875e-01,  5.04413303e-01,  1.97929059e+00, -1.04773679e+00,
       -3.39039973e-01, -1.02941765e+00,  6.82568600e-01,  5.99143108e-01,
        4.12036563e-01, -9.07680164e-01,  3.89428342e-01, -1.99812672e+00,
        2.30620607e+00, -2.17454122e+00, -8.19414136e-01, -7.82517452e-01,
        1.37022272e+00, -5.04288537e-02, -4.50647291e-01, -5.43751425e-01,
        4.12575680e-01,  1.57586272e+00, -8.24530475e-01, -4.47038684e-01,
       -6.43354471e-01, -1.29745194e+00,  7.26665228e-01,  1.21653438e-01,
       -2.53659706e-01,  9.66564956e-01, -1.85035873e+00, -7.94905513e-01,
        1.35323500e+00,  2.15849340e-01,  1.70992498e+00,  1.23657010e+00,
        2.18997840e+00,  1.49919685e+00,  8.77285666e-01, -1.07355077e+00,
        9.78479872e-02, -8.93355487e-01, -3.98155950e-01,  1.79528127e+00,
       -9.52105284e-01, -5.74666818e-01, -1.11701375e+00,  1.38500241e+00,
       -8.42883029e-01, -5.11371614e-01,  1.94607799e-01, -3.61449483e-01,
        3.29679468e-01,  2.06132343e+00,  2.28169237e-02,  1.66900937e-01,
        7.18921196e-02,  4.29228488e-01,  1.84520632e+00, -4.16848376e-01,
        6.56603466e-01, -1.62285122e-01,  5.24541399e-01, -9.18270625e-02,
        1.25672487e+00,  5.39837012e-01,  2.82396538e-01, -8.67069554e-01,
        1.90471520e+00,  1.12300168e+00, -1.12180589e+00,  7.67144493e-01,
        1.41897333e+00,  6.21709157e-01,  2.07656409e+00,  6.12903357e-01,
       -3.72550839e-01, -3.52462119e-01,  1.58733796e+00, -7.49020155e-01,
        2.16488089e-01, -1.23769550e+00, -8.44618640e-01,  4.49259855e-02,
        1.48179011e+00, -1.30293710e+00,  6.22324502e-02,  7.28385264e-01,
       -3.99810719e-01, -7.13099435e-01,  1.30550906e+00,  3.02892780e-01,
        5.21782015e-01,  1.40832870e+00, -7.19499468e-01,  7.29153711e-01,
       -2.52316301e-01, -7.13539137e-01,  7.05640982e-01, -2.21886190e+00,
       -1.18398491e+00, -1.35249093e-01,  9.94391128e-01,  2.27160057e+00,
        1.25510758e+00,  1.24979458e-01, -2.03330869e-01, -4.58890671e-01,
       -1.00576412e+00,  8.16660518e-01, -3.36323764e-01,  3.66920575e-01,
       -1.77446798e-01,  6.69652443e-01,  4.85547539e-01, -8.10531132e-01,
       -4.92715043e-01, -1.50885853e+00,  6.40666912e-01, -4.88587169e-01,
       -3.70376330e-01, -4.83889742e-01,  5.90214471e-01, -1.22056952e-01,
        2.80733796e-01, -1.72230692e+00, -2.73706569e-01, -1.16739856e-01,
        1.18952589e+00,  2.26249206e-01, -1.94171398e+00,  8.57957081e-01,
       -1.47122592e-01, -1.79500366e+00,  3.87537349e-01, -1.20942621e-01,
       -3.34576561e-02,  9.38438274e-02, -8.23940844e-01,  2.57867374e+00,
       -1.06621805e+00,  1.49901940e+00,  7.35003215e-01,  7.75227897e-02,
       -6.85015448e-03, -2.10664489e+00, -1.33805359e+00, -3.06041673e-02,
       -1.28125238e-02, -2.37144533e-01, -9.50529952e-01,  5.50580796e-01,
        8.87461371e-01, -4.01581758e-01,  4.06688038e-01, -1.09044928e+00,
        7.95477684e-01, -1.09844932e+00,  1.24568553e+00,  7.46318427e-01,
        2.53010976e-01,  8.29639192e-01, -7.18168800e-01,  2.82060886e-01,
       -1.48648899e-01, -4.82642557e-01,  2.64972817e-01,  1.05942172e+00,
        1.93233157e-01,  1.08573980e+00,  1.36994513e+00, -7.32280764e-01,
       -7.06519631e-01, -3.12883974e-01,  4.19867701e-01, -1.44299936e+00,
        4.08677293e-01, -2.17291867e-02, -1.59960968e+00, -1.65475346e+00,
        1.50957053e+00, -1.06330599e+00,  4.78922708e-01,  2.16096403e-01,
       -1.19325012e-01, -3.07925264e-01, -4.63303184e-01, -9.62372109e-01,
       -1.90840152e+00, -4.58759491e-01, -1.67134499e+00, -1.81126351e-01,
        2.83950367e-03,  1.15886400e+00,  7.61417825e-01,  3.77727988e-01,
        6.00664319e-01,  8.95256572e-03, -5.33030990e-01,  3.32610221e-02,
       -3.20536996e-01,  4.95314856e-01, -6.31253618e-02,  3.84104021e-01,
        6.75240182e-01, -2.46783962e+00, -7.13768307e-01,  1.00276960e+00,
        1.59641344e-01,  1.03739294e+00, -1.00955413e-01,  6.01534314e-01,
       -1.46232610e+00,  1.55236358e+00,  1.09353521e+00,  1.29158846e+00,
       -1.28547355e+00,  4.72126080e-01,  9.84606838e-02,  7.40573642e-01,
        6.00458522e-01, -1.55243602e-01, -8.06574521e-01,  1.13166070e+00,
        1.90263404e-01,  2.11536305e+00,  1.43269557e+00,  1.13835951e+00,
        1.64210204e+00,  4.08915752e-01, -2.14890403e+00,  1.10618554e+00,
        8.41461399e-01,  5.35775340e-01, -9.30090953e-01,  1.36120157e+00,
       -7.94365009e-01,  1.65223945e+00,  2.72544567e+00,  4.53760985e-01,
       -1.91242867e+00,  1.38776374e+00,  8.97090265e-01, -3.00782335e-01,
       -6.76145180e-01, -4.46046518e-01, -6.89977723e-01, -3.92854893e-01,
       -3.22032973e-01,  2.49718105e-01,  1.54180505e-01,  4.64216802e-01,
        7.69998941e-02,  2.51976574e+00,  5.39059870e-01,  1.29587161e-01,
       -1.16011637e+00,  6.62054986e-01,  4.26588267e-01, -4.86687512e-01,
        1.24072228e-01, -3.21783089e-01,  1.20085411e-01,  9.69284755e-01,
        6.28281409e-02,  2.02200105e+00, -1.86458333e-01,  1.13797221e-01,
        9.24254794e-01,  1.87276452e-01, -6.08867897e-01, -1.34940348e+00,
       -8.48986663e-01, -1.01522665e+00,  9.42082654e-01, -4.43541898e-01,
        3.48088495e-01,  1.47417784e+00, -5.87400254e-01, -1.62847082e+00,
        1.48252269e+00, -2.06109465e-01, -1.21145044e-01, -9.20343187e-01,
        1.18608610e+00,  8.28174105e-01,  1.03153223e+00, -8.50413986e-01,
       -1.14247785e+00,  3.44972940e-02, -2.95098196e-01, -8.31365155e-01,
        3.23052303e-01,  7.85481592e-01, -1.09639620e+00,  1.36633159e-01,
        1.59711221e+00,  5.00851638e-01,  1.25130581e+00,  2.63501525e+00,
       -2.94724912e-01, -1.13551585e+00, -1.61732322e+00, -3.18440455e-01,
        6.75857768e-01, -7.69755829e-01, -7.09848199e-01, -8.91482381e-01,
        9.87878177e-01,  6.51867843e-01, -1.27332802e+00,  1.25071267e+00,
       -6.44118187e-01, -2.20035608e-01, -9.22032504e-01,  4.67811024e-01,
       -8.52780836e-01, -7.91270642e-01, -8.61109527e-01, -1.69774698e+00,
        9.88148985e-01, -3.70577400e-01, -5.61500984e-01,  1.32292682e-01,
       -3.33171303e-01, -1.54838306e+00, -1.62991976e+00,  1.57332852e+00,
       -4.25280141e-01, -2.50585019e-01,  7.23969530e-01, -2.51956848e-01,
       -5.99469107e-02, -1.28903997e+00, -5.98763755e-02,  1.21712026e-01,
        5.58364081e-01, -1.06575487e+00, -7.05633412e-01,  5.71238429e-01,
       -7.50964717e-01,  4.46474683e-01,  1.05891983e-01,  1.22562033e+00,
        7.49933480e-01, -7.02051448e-01, -1.65260970e-01,  2.33126881e-01,
        1.27004018e-01,  5.04521898e-01,  1.31573295e+00,  1.12586192e+00,
       -3.05358237e-02, -1.17321180e+00, -2.04557498e+00, -9.77191086e-01,
       -2.30770580e-01, -1.12562361e+00,  6.72742813e-01, -1.53413814e+00,
       -3.64586926e-01, -1.97697415e+00,  1.09424750e-01,  2.32387978e-01,
       -2.81236052e-01, -2.77205886e-01,  6.33007587e-01, -7.93375275e-01,
        1.18278611e+00, -6.28132574e-01,  6.55595928e-02,  1.26757103e+00,
       -6.19016650e-01, -1.35298582e+00, -1.69342641e+00,  1.52836804e+00,
       -1.36124329e+00,  2.55509834e+00, -2.00069544e-01, -1.12227649e+00,
        9.20829258e-01, -1.13352415e+00,  6.37218337e-01,  1.57529723e+00,
       -9.03205727e-01, -8.24436550e-02,  3.85705647e-03, -9.28454831e-02,
       -1.00174468e+00,  4.08431209e-01,  3.48615758e-01, -6.10177073e-01,
       -7.41955057e-01, -2.29090247e-01, -3.32619435e-01,  3.68741433e-01,
       -8.00829203e-02,  1.11608384e+00, -4.23037903e-01,  8.05368019e-01,
       -6.53175267e-02, -1.90692267e-01,  2.76511821e-01,  1.83443461e+00,
        3.04282647e-01,  6.67805321e-02,  9.85428893e-01,  1.34286313e-01,
       -3.62068003e-01, -6.64536476e-02, -2.05071501e-01,  4.71120975e-01,
       -3.53851214e-01, -1.80563031e+00,  2.23074943e+00, -5.24521335e-01,
        2.75479702e-01,  4.11767714e-01,  1.38264395e+00, -8.74482079e-01,
       -8.30202124e-01, -1.58654013e+00,  3.69031334e-01,  3.93621085e-01,
        1.20809896e-01, -1.04982239e+00,  1.20453880e+00,  1.40843703e-02,
        7.23479513e-02, -1.40922527e+00, -5.64154670e-01,  2.05085282e+00,
       -8.35846806e-01,  1.48931213e-01,  7.47202194e-01, -1.21782541e+00,
        1.82167956e+00, -6.93767092e-01,  8.21182126e-01,  8.76514865e-01,
        1.18840983e-02, -9.02280695e-01, -1.45747966e+00, -6.14551824e-01,
        7.42669078e-02, -1.03125267e+00, -4.32778580e-01,  8.38090167e-02,
        9.30160391e-01, -5.54747484e-01, -9.15979993e-01, -9.20965301e-01,
       -1.13991926e+00,  1.42385479e+00,  7.73751970e-01, -1.09258354e+00,
        1.76323151e+00,  9.30875163e-01, -2.00261286e+00,  1.22285145e+00,
        9.65433447e-03, -1.55726616e+00,  1.01803941e-01,  2.63152764e+00,
       -1.76092674e-01, -7.47080550e-02,  8.19557076e-01, -3.17911079e-01,
       -2.62454302e-02, -2.07954680e-02, -1.08001334e+00,  1.24424763e-01,
        1.55635894e+00, -2.43790001e+00,  4.47523452e-01, -8.77179284e-01,
       -1.69569728e+00,  7.23414917e-01,  4.36462859e-01,  1.05793972e+00,
       -1.26716734e-01,  4.69880792e-01, -3.07354229e+00, -9.51259857e-01,
       -2.68334160e-01, -9.13805557e-01,  2.07087314e-01,  1.02775496e-01,
       -8.02475661e-01, -6.11943472e-01, -2.20029648e-01,  7.30840644e-01,
        4.01795260e-01,  6.42035951e-01,  2.79867970e-01, -1.70847531e+00,
       -4.44556943e-01,  7.62893635e-01, -7.15681196e-01, -3.53923753e-01,
        7.45750457e-01, -9.69848820e-01, -5.49278821e-01,  3.48537771e+00,
        1.25283832e+00, -1.50233045e+00, -1.28744311e+00, -2.11104824e+00,
       -4.14874691e-01,  1.14915027e+00, -6.17557497e-01,  1.45664879e+00,
       -2.48435708e-01,  1.24108735e-01,  2.58153746e-01,  3.11689278e-01,
       -6.57283019e-01, -2.58226240e-01, -2.23949481e+00,  4.94936745e-01,
       -5.81462461e-01,  3.74105573e-01, -6.03826700e-01,  1.50478449e-01,
       -5.39995506e-01,  1.33058461e+00,  6.19242116e-01,  2.38785077e-01,
        4.47465849e-01,  3.59119143e-01, -1.35990259e+00, -2.72299398e+00,
        3.31590907e-01, -8.79796487e-01,  9.95689083e-01,  6.00437285e-01,
        2.98472667e+00, -1.20231615e+00, -3.67152148e-01,  2.27578459e+00,
        1.37553192e+00,  2.37752281e-01, -1.16496114e+00, -8.83616775e-01,
        5.66415747e-01, -1.89784944e+00, -4.60040113e-01,  9.15678709e-01,
       -9.92397452e-01, -1.06602609e+00,  1.47506340e+00,  1.16706088e+00,
        1.30921893e+00,  2.20756607e+00,  1.43752617e-01,  1.29673383e+00,
       -6.92883667e-01,  8.50607894e-01,  7.19015191e-01,  7.42835407e-01,
       -6.51435087e-02,  5.28968607e-01,  3.94181355e-02, -2.22178358e-01,
        4.96222087e-01, -9.07037373e-01,  6.18464002e-01,  6.28897584e-01,
        5.56206746e-01,  2.08939012e+00,  9.50251833e-01, -3.95806558e-01,
        1.11352669e-01, -1.76902427e+00,  4.19568562e-01,  8.16463625e-01,
       -3.49135567e-01,  1.65319494e+00,  1.46988597e+00, -1.71423431e+00,
        1.19451553e+00, -6.56411675e-01, -5.34426511e-01, -7.19517764e-01,
        5.19451135e-01,  1.45053535e+00, -9.10028787e-01, -2.10604047e+00,
       -5.81604205e-02, -1.65998925e-01,  1.16951994e+00, -1.66981576e+00,
       -5.36259509e-02,  7.95074836e-01,  5.68829466e-01, -3.07024955e-01,
        1.83625166e+00, -1.08143714e+00,  1.68169620e-01, -3.47842660e-03,
       -8.75827898e-01,  1.35061307e-01, -6.55185774e-01, -6.72676626e-01,
       -3.03927340e-01, -7.11737565e-01,  1.40678868e-01,  1.20570282e-01,
       -3.05619551e-01, -3.69300861e-01,  7.07952892e-02,  1.58112308e+00,
       -2.04964507e-01,  7.19576660e-01, -7.94638126e-01, -1.25387542e+00,
       -5.72980041e-01,  9.99170289e-01,  5.42748731e-01, -1.29231528e+00,
        2.80111363e-01,  1.02086461e+00,  1.33954645e-01, -4.32495768e-01,
        1.36962765e+00, -2.21331524e-01, -4.97675356e-01, -6.54913450e-01,
        3.40700134e-02, -2.15085873e-01, -1.49479370e+00,  7.91042933e-01,
        1.28908480e+00, -1.52391118e-02,  2.74442502e+00, -2.05244284e+00,
       -1.05261833e+00, -7.90952020e-01,  2.45131863e-01,  6.47839911e-01,
        3.26247197e-01,  1.90699921e-02,  7.31149370e-01, -3.00568352e+00,
       -1.66757602e+00, -2.21318278e-01,  9.00179012e-01, -7.11180667e-01,
       -1.25618299e+00,  5.23515530e-01,  2.30790599e+00,  6.92025901e-01,
        6.60577314e-01, -4.42652384e-01,  1.35489505e+00, -2.53530444e-01,
        1.41349414e-01, -7.02616501e-01, -1.67535898e+00, -1.05584575e+00,
        3.60598303e-01, -3.46588044e-01,  2.49433630e-01,  5.48353328e-02,
        1.94935630e+00,  4.75397927e-01, -6.84707765e-01, -4.50715635e-01,
       -1.02913857e+00, -5.20280989e-01,  5.78315488e-02,  1.51369340e+00,
       -6.39201462e-01, -1.27468907e+00,  1.80316825e+00,  6.36592019e-01,
        7.64395215e-01, -2.18779533e+00,  9.04663256e-01, -1.60902565e+00,
       -9.17064331e-01,  9.31787692e-01,  1.11991980e+00, -1.07508097e-01,
        2.83246916e-01,  3.10967379e-01, -6.48263705e-02,  5.68462323e-01,
       -2.62194127e-01, -1.79822506e+00, -4.93020603e-01, -7.38295515e-01,
        4.15284066e-01, -3.84211758e-01,  4.47633855e-01, -1.29470558e-01,
       -4.61877882e-01,  1.29341062e+00, -5.07843581e-01,  1.01407100e+00,
        1.02458638e+00, -6.83690923e-01, -1.55607291e-01,  1.78507923e+00,
       -4.51859133e-01,  1.70553610e-01,  5.20986528e-01, -3.76069441e-01,
       -2.37629662e-02,  5.19880206e-01,  1.10505433e-02,  2.43580573e-01,
       -1.02515105e+00,  3.84408763e-01, -6.23967104e-02, -6.40646935e-01,
        8.44974094e-01, -2.76332263e-01,  2.37119664e-01,  2.64872069e+00,
       -5.89641654e-01,  3.75044582e-01,  1.16327659e+00,  2.77989350e-01,
       -1.62362254e+00,  1.24534410e+00,  1.83618815e+00,  2.86537261e-01,
        5.03237236e-01,  1.11839364e+00, -8.16752301e-02, -1.40667989e+00,
        1.53623760e-01, -1.09948924e+00, -7.37071497e-01,  1.76238694e+00,
       -1.98097278e+00, -1.01469501e+00,  3.85772946e-01,  9.65272729e-01,
        9.67325642e-01, -1.14554198e+00, -2.26853305e+00,  1.68920407e+00,
       -3.11963656e-01,  7.07668098e-01,  6.94836995e-01,  1.10364017e+00,
       -8.51300327e-02, -1.67733934e+00,  7.00242369e-01,  5.16717695e-01,
       -5.08716067e-01,  5.63996659e-01, -3.05351411e-01,  9.44560381e-01,
       -1.48206020e+00, -2.76993298e-01, -1.26551477e+00,  7.59764639e-01,
       -7.07799457e-01, -1.72600502e-01,  1.55826994e-01,  1.47586185e+00,
       -5.16751673e-01,  1.23541147e+00,  1.01928947e+00,  8.76010451e-01,
       -4.24498117e-01, -2.37622006e-01,  2.36617970e-01,  3.82398040e-01])

In [75]:
quartiles = pd.qcut(data, 4, precision=2)
quartiles

[(0.05, 0.72], (-0.66, 0.05], (-0.66, 0.05], (0.72, 3.49], (-3.0799999999999996, -0.66], ..., (0.72, 3.49], (-0.66, 0.05], (-0.66, 0.05], (0.05, 0.72], (0.05, 0.72]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.0799999999999996, -0.66] < (-0.66, 0.05] < (0.05, 0.72] < (0.72, 3.49]]

In [76]:
quartiles.value_counts()

(-3.0799999999999996, -0.66]    250
(-0.66, 0.05]                   250
(0.05, 0.72]                    250
(0.72, 3.49]                    250
Name: count, dtype: int64

In [78]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.018002     0.001901     0.105537    -0.004458
std       0.956695     1.031125     0.988945     0.997066
min      -2.992845    -3.057874    -2.959338    -2.963747
25%      -0.675499    -0.680858    -0.587106    -0.658160
50%      -0.001045     0.004384     0.130620    -0.028344
75%       0.605185     0.694016     0.801122     0.704848
max       3.062633     3.103614     2.777322     2.964015

In [80]:
col = data[2]
col[col.abs() > 2]

5      2.776285
23    -2.127670
26    -2.715874
47    -2.959338
53    -2.546197
130   -2.919926
214    2.638558
238    2.265706
302    2.777322
323   -2.147164
393    2.619644
397   -2.477309
421    2.141348
451    2.027972
458   -2.406016
496    2.590890
502   -2.467304
507    2.091968
519   -2.463941
539    2.276271
598   -2.620878
603   -2.127647
624    2.053629
626   -2.285906
629    2.732485
638    2.306801
660    2.027460
667    2.365350
676    2.603348
680    2.206412
705   -2.321040
720    2.768601
773    2.011263
793    2.158277
796    2.195068
806   -2.451915
824   -2.565447
831   -2.201393
857    2.113103
882   -2.043471
919   -2.019229
925    2.162056
941    2.629455
Name: 2, dtype: float64

In [83]:
data[(data.abs() > 3).any(axis=1)]

            0         1         2         3
400  3.062633  0.036303 -1.572405  1.104672
422  0.323433  3.103614  1.025505  0.012309
893  0.453857  3.024699 -0.543959 -0.381890
988  0.652320 -3.057874 -0.939880  0.267999

In [87]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.018065     0.001830     0.105537    -0.004458
std       0.956495     1.030576     0.988945     0.997066
min      -2.992845    -3.000000    -2.959338    -2.963747
25%      -0.675499    -0.680858    -0.587106    -0.658160
50%      -0.001045     0.004384     0.130620    -0.028344
75%       0.605185     0.694016     0.801122     0.704848
max       3.000000     3.000000     2.777322     2.964015

In [88]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0  1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0  1.0  1.0  1.0
4  1.0 -1.0 -1.0 -1.0

In [89]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [90]:
sampler = np.random.permutation(5)
sampler

array([2, 1, 3, 4, 0], dtype=int32)

In [91]:
df.take(sampler)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [92]:
df.iloc[sampler]

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [93]:
col_sampler = np.random.permutation(df.columns)
col_sampler

array([4, 2, 6, 0, 3, 1, 5])

In [94]:
df.take(col_sampler, axis=1)

    4   2   6   0   3   1   5
0   4   2   6   0   3   1   5
1  11   9  13   7  10   8  12
2  18  16  20  14  17  15  19
3  25  23  27  21  24  22  26
4  32  30  34  28  31  29  33

In [95]:
df.T.iloc[col_sampler].T

    4   2   6   0   3   1   5
0   4   2   6   0   3   1   5
1  11   9  13   7  10   8  12
2  18  16  20  14  17  15  19
3  25  23  27  21  24  22  26
4  32  30  34  28  31  29  33

In [96]:
df.sample(3)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [98]:
df.sample(frac=0.5)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [99]:
df.sample(10, replace=True)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20

In [100]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [101]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [102]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummies = df[['data1']].join(dummies)
df_with_dummies

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [103]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [104]:
dummies = movies['genres'].str.get_dummies('|')
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [105]:
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [106]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [109]:
np.random.seed(12345)
values = np.random.uniform(size=10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [110]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [111]:
s = pd.Series([1, 2, 3, None])
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [112]:
s.dtype

dtype('float64')

In [113]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [114]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [115]:
s.dtype

Int64Dtype()

In [116]:
s[3]

In [117]:
s[3] is pd.NA

True

In [118]:
s = pd.Series([1, 2, 3, None], dtype='Int64')
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [119]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())

In [120]:
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [121]:
df = pd.DataFrame({'A': [1, 2, None, 4],
                   'B': ['one', 'two', None, 'three'],
                   'C': [False, None, True, False]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN   None   True
3  4.0  three  False

In [122]:
df['A'] = df['A'].astype('Int64')
df['B'] = df['B'].astype('string')
df['C'] = df['C'].astype('boolean')
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>   <NA>   True
3     4  three  False

In [123]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [124]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [126]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [127]:
'::'.join(pieces)

'a::b::guido'

In [128]:
'guido' in val

True

In [129]:
val.index(',')

1

In [130]:
val.find(':')

-1

In [132]:
val.count(',')

2

In [133]:
val.replace(',', '::')

'a::b::  guido'

In [134]:
val.replace(',', '')

'ab  guido'